src/InformationRegisters/ФИОФизическихЛиц/ФИОФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Инициалы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИнициалыИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ФИОСлужебные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ФИОФизическихЛиц/Forms/ФормаИзмененияФИО/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Наименование = "";
	Если Не Параметры.Свойство("Наименование", Наименование) Тогда
		ТекстСообщения = НСтр("ru='Открытие формы возможно только из формы физического лица'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЧастиФИО = СтрРазделить(Наименование, " ");
	Если ЧастиФИО.Количество() > 0 Тогда
		
		Фамилия = ЧастиФИО[0];
		
		Если ЧастиФИО.Количество() > 1 Тогда
			Имя = ЧастиФИО[1];
		КонецЕсли;
		
		Если ЧастиФИО.Количество() > 2 Тогда
			
			ЧастиОтчества = Новый Массив;
			Для индекс = 2 По ЧастиФИО.Количество() - 1 Цикл
				ЧастиОтчества.Добавить(ЧастиФИО[индекс]);
			КонецЦикла;
			Отчество = СтрСоединить(ЧастиОтчества, " ");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Период = ТекущаяДатаСеанса();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СтруктураФИО = Новый Структура;
	СтруктураФИО.Вставить("Фамилия", Фамилия);
	СтруктураФИО.Вставить("Имя", Имя);
	СтруктураФИО.Вставить("Отчество", Отчество);
	СтруктураФИО.Вставить("Период", Период);
	Закрыть(СтруктураФИО);
	
КонецПроцедуры

#КонецОбласти
